<a href="https://colab.research.google.com/github/brandnewmin/brandnewm/blob/master/dacon3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [32]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
plt.style.use('seaborn')
sns.set(font_scale=2.5)
%matplotlib inline

In [33]:
import missingno as msno #결측값보이기

In [34]:
pd.options.display.float_format='{:.2f}'.format

In [35]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [36]:
train = pd.read_csv('/content/drive/My Drive/data/train.csv')
train.head()

   store_id        date      time  ... installments  days_of_week  holyday
0         0  2016-12-14  18:05:31  ...          nan             2        0
1         0  2016-12-14  18:05:54  ...          nan             2        0
2         0  2016-12-19  12:42:31  ...          nan             0        0
3         0  2016-12-19  12:48:08  ...          nan             0        0
4         0  2016-12-19  13:31:08  ...          nan             0        0

[5 rows x 8 columns]

In [37]:
def splite_date(date):
  return date.split("-")

In [38]:
train['year'], train['month'], train['day'] = zip(*train['date'].apply(lambda x:splite_date(x)))

In [39]:
train['month'] = train['month'].astype(int) #무슨 차이일가 흠
#이게 왜 필요할까?
type(train['month'])

pandas.core.series.Series

In [40]:
train=train.fillna(1)

In [41]:
train['total_amount'] = train['amount'] * train['installments']

In [42]:
#dacon2랑 비교하려고 수정 안 함
fifth = train[['store_id','card_id','days_of_week','holyday','year','month','day','total_amount']].groupby(['store_id','card_id'], as_index=False).sum()
fifth.head()

   store_id     card_id  days_of_week  holyday  month  total_amount
0         0  000133a3c2             4        0     15        148.00
1         0  000744fa2e             5        0      9         55.00
2         0  000931da3a             0        0     11         38.00
3         0  0009529600            24        0     54        211.00
4         0  000abf87bd            38        1     76       3123.00

## 의문점

In [43]:
###################
#store_id별 총액을 알고 싶은거지
#cardid 구분이 왜 필요했는가? 그러게 왜 필요했지??
#시간별 총액 변하는 추이를 알고 싶었으니깐, month 구분별도 필요함

In [61]:
#cardid구분이 있는 경우
train_newgr=train[['store_id','card_id','days_of_week','holyday','year','month','day','total_amount']].groupby(['store_id','card_id','days_of_week','holyday','year','month','day'], as_index=False).sum()
train_newgr.head()
#fifth와 다른 점 : month day year 등이 합쳐지지 않음 -> 기대 : 월별 그래프 확인 가능

   store_id     card_id  days_of_week  holyday  year  month day  total_amount
0         0  000133a3c2             1        0  2017      5  16         87.00
1         0  000133a3c2             2        0  2017      5  17         61.00
2         0  000744fa2e             5        0  2017      9  23         55.00
3         0  000931da3a             0        0  2017     11  06         38.00
4         0  0009529600             1        0  2017      9  05         38.00

In [62]:
train_newgr.shape #fifth와 유사한 데이터 : 행에서 차이가 있을 가능성 : 월별로도 그룹을 했기 때문에, store_id card_id 다음 가지가 또 있음 / 열 당연히 늘어남

(3165601, 8)

In [63]:
train_newgr['total_amount'].describe()
#train_newgr[train_newgr['total_amount'] >= 0]

count   3165601.00
mean        184.90
std        2393.58
min     -750000.00
25%          35.00
50%          80.00
75%         155.00
max     1198800.00
Name: total_amount, dtype: float64

In [65]:
train_newgr[train_newgr['total_amount'] <0].value_counts() #sum까지 했는데 도대체 어떻게 하면 -가 나오냐 아니 심지어 12월28일이면 12월엔 sum해서 합쳐진 금액들은 이미 사라졌다는 거잖아 근데 왜 있냐고

store_id  card_id     days_of_week  holyday  year  month  day  total_amount
1795      9a7ebebed8  0             0        2017  12     04   -225.00         1
529       be39e42883  1             0        2017  1      03   -2247.00        1
519       1913fd8947  2             0        2017  2      22   -14400.00       1
          1c7d9702b2  4             0        2017  4      28   -12000.00       1
          56db9ebd1f  0             0        2018  4      23   -1650.00        1
                                                                              ..
1202      2ea2c320a5  0             0        2018  3      19   -510.00         1
          375c77a36d  2             0        2018  2      14   -24.00          1
          bf03f7541e  3             0        2018  4      12   -895.00         1
1203      1279e98334  2             0        2016  12     28   -950.00         1
0         0130c98e0d  3             0        2017  4      06   -68.00          1
Length: 1860, dtype: int64

In [66]:
newgr=train_newgr[train_newgr['total_amount'] >= 0]
newgr.head()

   store_id     card_id  days_of_week  holyday  year  month day  total_amount
0         0  000133a3c2             1        0  2017      5  16         87.00
1         0  000133a3c2             2        0  2017      5  17         61.00
2         0  000744fa2e             5        0  2017      9  23         55.00
3         0  000931da3a             0        0  2017     11  06         38.00
4         0  0009529600             1        0  2017      9  05         38.00

In [67]:
newgr.shape #역시 train1과 행 같을 수 없음

(3163741, 8)

In [68]:
newgr['total_amount'].value_counts() #빈도가 한 번뿐인 것들이 있네 이런 값들도 제거 할 만한 타당한 이유가 있을까?

30.00      74841
35.00      68807
40.00      63663
80.00      62408
22.00      61651
           ...
4923.00        1
4915.00        1
4912.00        1
4910.00        1
4311.00        1
Name: total_amount, Length: 5696, dtype: int64

In [69]:
newgr['total_amount'].describe()

count   3163741.00
mean        188.54
std        2159.01
min           0.00
25%          35.00
50%          80.00
75%         156.00
max     1198800.00
Name: total_amount, dtype: float64

In [74]:
#storeid별 월별 매출액 평균
monthly_storeid=newgr[['store_id','month','total_amount']].groupby(['store_id','month'], as_index=False).mean()
monthly_storeid.head()

   store_id  month  total_amount
0         0      1         95.70
1         0      2         89.79
2         0      3         84.37
3         0      4         88.81
4         0      5         84.58

In [75]:
monthly_storeid['total_amount'].describe()

count    17242.00
mean      1456.89
std       9211.33
min          0.00
25%        105.11
50%        201.40
75%        563.81
max     453319.33
Name: total_amount, dtype: float64

In [77]:
#라벨링 (75%이하 값 0)
#75%이상 값 1
monthly_storeid['label'] = [1 if a > 563.81 else 0 for a in monthly_storeid['total_amount']]
monthly_storeid.head()

   store_id  month  total_amount  label
0         0      1         95.70      0
1         0      2         89.79      0
2         0      3         84.37      0
3         0      4         88.81      0
4         0      5         84.58      0

In [ ]:
#시각화하면 되나요?

In [45]:
#가끔 알 수 없는 마이너스 값때문에 시간을 제외햇는데, 시간을 제외하면 시간별 자료 추이를 못 보니깐 아무튼 이렇게 하는게 맞는거고
#6월까지 구매한 것들을 7월에 환불한 경우를 제외할 순 없게 되었는데 이걸 생각 속에서 지워야할까?

## ----

In [46]:
train1 = fifth[fifth['total_amount'] >= 0]
train1.head()

   store_id     card_id  days_of_week  holyday  month  total_amount
0         0  000133a3c2             4        0     15        148.00
1         0  000744fa2e             5        0      9         55.00
2         0  000931da3a             0        0     11         38.00
3         0  0009529600            24        0     54        211.00
4         0  000abf87bd            38        1     76       3123.00

In [47]:
train1['total_amount'].describe()

count   1797861.00
mean        325.58
std        4218.53
min           0.00
25%          60.00
50%         119.00
75%         240.00
max     1671700.00
Name: total_amount, dtype: float64

## train2 : storeid별 매출액 평균

In [48]:
train2 = train1[['store_id','total_amount']].groupby(['store_id'], as_index=False).mean()
train2.head()

   store_id  total_amount
0         0        427.86
1         1      94556.25
2         2        178.40
3         3        273.14
4         4        229.86

In [49]:
#month별
train2222 = train1[['store_id','month','total_amount']].groupby(['store_id','month'], as_index=False).mean()
train2222.head()

   store_id  month  total_amount
0         0      1         93.93
1         0      2         93.88
2         0      3         87.95
3         0      4         95.46
4         0      5        100.11

In [50]:
under_train2 = train2[train2['total_amount'] <= 1064.59] #75%위치값
under_train2.head()

   store_id  total_amount
0         0        427.86
2         2        178.40
3         3        273.14
4         4        229.86
6         6        743.87

In [51]:
over_train2 = train2[train2['total_amount'] > 1064.59]
over_train2.head()

    store_id  total_amount
1          1      94556.25
5          5       3009.67
7          7       1479.86
9          9      13531.11
10        10       1301.43

In [52]:
train2['group'] = [1 if a > 1064.59 else 0 for a in train2['total_amount']]
train2.head()

   store_id  total_amount  group
0         0        427.86      0
1         1      94556.25      1
2         2        178.40      0
3         3        273.14      0
4         4        229.86      0

## card_id별 소비액 평균

In [53]:
train3 = train1[['card_id','total_amount']].groupby(['card_id'], as_index=False).mean()
train3.head()

      card_id  total_amount
0  000009e765         10.00
1  00000f9eaa        110.33
2  0000134335         90.00
3  000024f480         80.00
4  000036a26b        720.00

In [54]:
#month 추가
train3_month = train1[['card_id','total_amount','month']].groupby(['card_id','month'], as_index=False).mean()
train3_month.head()

      card_id  month  total_amount
0  000009e765      7         10.00
1  00000f9eaa      3        123.00
2  00000f9eaa     10        100.00
3  00000f9eaa     24        108.00
4  0000134335      5         90.00

In [55]:
quarter = []
for month in train3_month['month'] :
  if month < 4:
    quarter.append(1)
  elif month < 7:
    quarter.append(2)
  elif month < 10:
    quarter.append(3)
  else : quarter.append(4)

train3_month['quarter'] = quarter

In [56]:
train3_month.head()

      card_id  month  total_amount  quarter
0  000009e765      7         10.00        3
1  00000f9eaa      3        123.00        1
2  00000f9eaa     10        100.00        4
3  00000f9eaa     24        108.00        4
4  0000134335      5         90.00        2

In [57]:
train3.describe()

       total_amount
count     922519.00
mean         338.57
std         3150.77
min            0.00
25%           75.00
50%          138.00
75%          250.00
max      1080000.00

In [58]:
under_train3 = train3[train3['total_amount'] <= 250] #75%위치값
under_train3.head()

      card_id  total_amount
0  000009e765         10.00
1  00000f9eaa        110.33
2  0000134335         90.00
3  000024f480         80.00
6  00003cb9a7         85.00

In [59]:
over_train3 = train3[train3['total_amount'] > 250]
over_train3.head()

       card_id  total_amount
4   000036a26b        720.00
5   00003c84e3        255.00
9   00008a3f32        335.00
12  0000aee7ef        360.00
13  0000d054a6        423.50

In [60]:
train3['group'] = [1 if a > 250 else 0 for a in train3['total_amount']]
train3.head()

      card_id  total_amount  group
0  000009e765         10.00      0
1  00000f9eaa        110.33      0
2  0000134335         90.00      0
3  000024f480         80.00      0
4  000036a26b        720.00      1

## 시각화